import React from "react";

const Rules = () => {
  return (
    <div className="rules-container">
      <h1 className="title-rules">
        Добро пожаловать в семью <span className="heading">Footwise!</span>
      </h1>
      <p className="default-text">
        Мы не букмекеры, и мы не пытаемся предсказать будущее. Мы просто хотим
        делиться с вами любовью к футболу! В{" "}
        <span className="important-text">Footwise</span> вы сможете проверить
        свои знания, потренировать интуицию и получить награды за точные
        прогнозы и умение разгадывать футбольные тайны.
      </p>

      <p className="default-text">
        📢 <span className="important-text">Первый сезон уже здесь!</span> Мы
        набираем 50 участников, и этот сезон продлится всего 2 месяца. За это
        время мы устроим захватывающие квизы, прогнозы и, конечно же, вручим
        призы тем, кто покажет лучшие результаты. В{" "}
        <span className="important-text">Footwise</span> главное – честная игра
        и дружеская атмосфера. Мы хотим, чтобы каждый из вас почувствовал себя
        частью нашей футбольной семьи.
      </p>

      <p className="default-text">
        Наши планы не ограничиваются только квизами и прогнозами – это только
        начало! Мы полны идей и энтузиазма, и обязательно поделимся всем этим с
        вами через наш Telegram-канал. Следите за нами, чтобы не пропустить ни
        одного интересного обновления!
      </p>

      <h2 className="section-header">Как стать частью Footwise?</h2>
      <p className="default-text">
        Доступ в приложение платный:
        <br />
        Оплата через администратора в Telegram.
        <br />
        Стоимость входа – <span className="points">4$</span>, за которые
        вы получаете 10 очков для начала игры.
      </p>

      <h2 className="section-header">Как стать участником бесплатно?</h2>
      <p className="default-text">
        Просто пригласите 3 друзей, и вы получите{" "}
        <span className="points">5 очков</span> бесплатно.
        <br />
        Обязательное условие:
        <br />
        Вступите в наш Telegram-канал – это поможет вам быть в курсе всех
        новостей, получать обновления и общаться с другими участниками.
      </p>

      <h2 className="section-header">Правила игры</h2>
      <p className="default-text">
        Прогнозируйте исходы матчей, участвуйте в квизах и зарабатывайте очки.
        <br />
        Используйте свои очки для участия в новых играх, ставках и прогнозах.
        <br />
        Чем точнее ваши прогнозы, тем больше шансов на победу!
      </p>

      <h2 className="section-header">Этические принципы Footwise</h2>
      <ul className="default-text">
        <li>
          Будьте честны в своих прогнозах и не используйте нечестные методы.
        </li>
        <li>С уважением относитесь к другим игрокам и их мнениям.</li>
        <li>
          Действуйте доброжелательно – независимо от того, выигрываете ли вы или
          нет.
        </li>
      </ul>

      <h2 className="section-header">Награды и признание</h2>
      <p className="default-text">
        Каждую неделю мы выбираем Лучшего игрока – того, кто наберет больше
        всего очков за неделю!
        <br />
        Победитель недели получает:
        <br />
        <span className="points">+10 очков</span> для следующего сезона.
        <br />
        Публичное признание и похвалу в нашем Telegram-канале.
      </p>

      <h2 className="section-header">Footwise – это сообщество!</h2>
      <p className="default-text">
        Это место, где вы можете стать лучшим и получить заслуженное признание.
        Следите за новостями, присоединяйтесь к нам и будьте частью нашего пути.
        Мы на старте, и нам важно, чтобы каждый из вас был с нами. 🌱
      </p>

      <p className="default-text">
        Ваши прогнозы. Ваши очки. Ваши победы. Всё в ваших руках!
      </p>
    </div>
  );
};

export default Rules;
